<?php
/**
 * Russian language setting file
 * v.1.0
 * @author Intervision https://github.com/intervisionlord
 */

$lang['import_button'] = "Импорт";
$lang['formLegend']  = "Импортировать файл";
$lang['formIntroMessage'] = "Вы можете создать страницу **импортировав документ**, находящийся у Вас на компьютере.\\\
Процесс не идеален, всегда проверяйте корректность результата";
$lang['formPageExistMessage'] = "**Внимание!!! Эта страница уже существует. Если Вы загрузите файл, текущая страница будет перезаписана.**

";

$lang['ok_info'] = "Комментарий";

$lang['parserOriginalFile'] = "Импортированный файл";
$lang['parserSummary'] = "страница составлена через импорт файла плагином file2dw";

$lang['er_acl_create'] = "Не хватает прав для создания страницы здесь";
$lang['er_acl_edit'] = "Не хватает прав для редактирования страницы здесь";
$lang['er_acl_upload'] = "Не хватает прав для импорта файлов сюда";
$lang['er_apply_content'] = "Невозможно сохранить содержимое";
$lang['er_apply_file'] = "Невозможно сохранить оригинальный файл";
$lang['er_dir_create'] = "Директория не может быть создана";
$lang['er_file_getFromDownload'] = "Невозможно получить загружаемый файл";
$lang['er_file_miss'] = "Функция _file2dw() вызвана без указания загружаемого файла";
$lang['er_file_upload'] = "Что-то пошло не так во время загрузки файла";
$lang['er_file_tmpDir'] = "Невозможно создать временную директорию.";
$lang['er_id'] = "Некорректное использование плагина. Параметр _file2dw должен использоваться с указанием имени страницы (\$ID)";
$lang['er_img_dir'] = "Ошибка при обработке изображений в импортируемом файле";
$lang['er_img_upload'] = "Невозможно сохранить вложенные изображения";
$lang['er_logFile'] = "Невозможно записать что-либо в лог";
$lang['er_msg_nomessage'] = "Некорректное использование плагина. Параметр _msg должен вызываться с сопутствующим сообщением";
$lang['er_pandoc'] = "Конечный файл для программы pandoc не существует. Преобразование неудачно.";
$lang['er_soffice'] = "Конечный файл для программы soffice не существует. Преобразование неудачно";
